---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
source: html/41bfa44f-51b9-9dce-fd17-7d1fa372f2d1.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir

A constraint that can be applied to a RebarShapeSegment and fixes the
 direction of the segment in UV-space.

## Syntax (C#)
```csharp
public class RebarShapeConstraintFixedSegmentDir : RebarShapeConstraint
```